export default {
    None: 0,
    // Расходы на возмещение затрат работников по уплате процентов по кредитам на приобретение или строительство жилого помещения
    CompensationForEmployeesLoans: 1,
    // НИОКР
    ResearchAndDevelopment: 2,
    // Представительские расходы
    EntertainmentCosts: 3,
    // Расходы на рекламу
    Advertisement: 4,
    // Расходы в виде процентов по долговым обязательствам
    InterestOnDebt: 5,
    // Убыток от уступки права требования
    Cession: 6,
    // Потери от недостачи и/или порчи при хранении и транспортировке МПЗ
    DamageDuringStorage: 7,
    // Расходы по оплате стоимости проезда и провоза багажа работнику организации,
    // расположенной в районах Крайнего Севера и приравненных к ним местностям, и членам его семьи
    CompensationForTransportationFarNorth: 8,
    // Расходы на обязательное страхование имущества
    RequiredPropertyInsurance: 9,
    // Расходы на компенсацию за использование для служебных поездок личного транспорта
    CompensationForUsagePersonalTransport: 10,
    // Плата государственному и/или частному нотариусу за нотариальное оформление
    Notarization: 11,
    // Расходы обслуживающих производств и хозяйств
    ServiceProductionAndFarms: 12
};
