using System;
using System.Collections.Generic;
using System.Linq;
using System.Text.RegularExpressions;
using Moedelo.Address.Enums;

namespace Moedelo.Address.Shared
{
    public static class GarAddressObjectTypeGetter
    {
        private static readonly Dictionary<AddressObjectGarLevel, Dictionary<string, string>> Map = new Dictionary<AddressObjectGarLevel, Dictionary<string, string>>
        {
            #region Region
            {
                AddressObjectGarLevel.Region, new Dictionary<string, string>
                {
                    {"Автономная область", "а.обл."},
                    {"Автономный округ", "АО"},
                    {"Город", "г"},
                    {"Город федерального значения", "г.ф.з."},
                    {"Край", "край"},
                    {"Область", "обл"},
                    {"Округ", "округ"},
                    {"Республика", "Респ"},
                    {"Чувашия", "Чувашия"}
                }
            },
            #endregion

            #region District
            {
                AddressObjectGarLevel.District, new Dictionary<string, string>
                {
                    {"внутригородская территория (внутригородское муниципальное образование) города федерального значения", "вн.тер.г."},
                    {"Автономный округ", "АО"},
                    {"Внутригородская территория", "вн.тер. г."},
                    {"Город", "г"},
                    {"Городской округ", "г.о."},
                    {"Муниципальный округ", "м.о."},
                    {"Муниципальный район", "м.р-н"},
                    {"Федеральная территория", "ф.т."},
                    {"Поселение", "п"},
                    {"Район", "р-н"},
                    {"Территория", "тер."},
                    {"Улус", "у"}
                }
            },
            #endregion

            #region Settlement
            {
                AddressObjectGarLevel.Settlement, new Dictionary<string, string>
                {
                    {"внутригородской район", "вн.р-н"},
                    {"городское поселение", "г.п."},
                    {"межселенная территория", "межсел.тер."},
                    {"сельское поселение", "с.п."}
                }
            },
            #endregion

            #region City
            {
                AddressObjectGarLevel.City, new Dictionary<string, string>
                {
                    {"Волость", "волость"},
                    {"Город", "г"},
                    {"Дачный поселок", "дп"},
                    {"Курортный поселок", "кп"},
                    {"Массив", "массив"},
                    {"Поселок", "п."},
                    {"Поселок городского типа", "пгт"},
                    {"Почтовое отделение", "п/о"},
                    {"Рабочий поселок", "рп"},
                    {"Село", "с"},
                    {"Сельская администрация", "с/а"},
                    {"Сельский округ", "с/о"},
                    {"Сельское муницип.образование", "с/мо"},
                    {"Сельское поселение", "с/п"},
                    {"Сельсовет", "с/с"},
                    {"Территория", "тер."}
                }
            },
            #endregion

            #region Locality
            {
                AddressObjectGarLevel.Locality, new Dictionary<string, string>
                {
                    {"Аал", "аал"},
                    {"Автодорога", "автодорога"},
                    {"Арбан", "арбан"},
                    {"Аул", "аул"},
                    {"Волость", "волость"},
                    {"Выселки(ок)", "высел"},
                    {"Город", "г"},
                    {"Городок", "г-к"},
                    {"Городской поселок", "гп"},
                    {"Дачный поселок", "дп"},
                    {"Деревня", "д."},
                    {"ж/д останов. (обгонный) пункт", "ж/д_оп"},
                    {"Железнодорожная будка", "ж/д б-ка"},
                    {"Железнодорожная ветка", "ж/д в-ка"},
                    {"Железнодорожная казарма", "ж/д к-ма"},
                    {"Железнодорожная платформа", "ж/д пл-ма"},
                    {"Железнодорожная площадка", "ж/д пл-ка"},
                    {"Железнодорожная станция", "ж/д_ст."},
                    {"Железнодорожный блокпост", "ж/д бл-ст"},
                    {"Железнодорожный комбинат", "ж/д к-т"},
                    {"Железнодорожный остановочный пункт", "ж/д о.п."},
                    {"Железнодорожный пост", "ж/д_пост"},
                    {"Железнодорожный путевой пост", "ж/д п.п."},
                    {"Железнодорожный разъезд", "ж/д_рзд"},
                    {"Жилая зона", "жилзона"},
                    {"Жилой район", "жилрайон"},
                    {"Заимка", "заимка"},
                    {"Зимовье", "зим."},
                    {"Казарма", "казарма"},
                    {"Квартал", "кв-л"},
                    {"Кишлак", "киш."},
                    {"Кордон", "кордон"},
                    {"Курортный поселок", "кп"},
                    {"Леспромхоз", "лпх"},
                    {"Массив", "массив"},
                    {"Местечко", "м"},
                    {"Микрорайон", "мкр"},
                    {"Населенный пункт", "нп"},
                    {"Остров", "остров"},
                    {"Планировочный район", "пл.р-н"},
                    {"Погост", "погост"},
                    {"Поселок", "п."},
                    {"Поселок городского типа", "пгт"},
                    {"Поселок и(при) станция(и)", "п/ст"},
                    {"Поселок при железнодорожной станции", "п. ж/д ст."},
                    {"Поселок при станции (поселок станции)", "п. ст."},
                    {"Поселок разъезда", "пос.рзд"},
                    {"Починок", "починок"},
                    {"Почтовое отделение", "п/о"},
                    {"Промышленная зона", "промзона"},
                    {"Рабочий поселок", "рп"},
                    {"Разъезд", "рзд"},
                    {"Садовое неком-е товарищество", "снт"},
                    {"Сельсовет", "с/с"},
                    {"Село", "с"},
                    {"Сельский поселок", "сп"},
                    {"Слобода", "сл"},
                    {"Станица", "ст-ца"},
                    {"Станция", "ст"},
                    {"Территория", "тер."},
                    {"Улус", "у"},
                    {"Хутор", "х"}
                }
            },
            #endregion

            #region PlanningStructure
            {
                AddressObjectGarLevel.PlanningStructure, new Dictionary<string, string>
                {
                    {"Аал", "аал"},
                    {"Абонентский ящик", "а/я"},
                    {"Аллея", "ал."},
                    {"Арбан", "арбан"},
                    {"Аул", "аул"},
                    {"Берег", "б-г"},
                    {"Бульвар", "б-р"},
                    {"Вал", "вал"},
                    {"Въезд", "взд."},
                    {"Гаражно-строительный кооп.", "гск"},
                    {"Городок", "г-к"},
                    {"Дачное неком-е партнерство", "днп"},
                    {"Деревня", "д."},
                    {"Дорога", "дор."},
                    {"Железнодорожная будка", "ж/д б-ка"},
                    {"Железнодорожная казарма", "ж/д к-ма"},
                    {"Железнодорожная платформа", "ж/д пл-ма"},
                    {"Железнодорожная станция", "ж/д_ст."},
                    {"Железнодорожный разъезд", "ж/д рзд."},
                    {"Жилой район", "ж/р"},
                    {"Заезд", "ззд."},
                    {"Зона (массив)", "зона"},
                    {"Квартал", "кв-л"},
                    {"Километр", "км"},
                    {"Кольцо", "к-цо"},
                    {"Коса", "коса"},
                    {"Линия", "лн."},
                    {"Местечко", "м-ко"},
                    {"Местность", "местность"},
                    {"Месторождение", "мр."},
                    {"Микрорайон", "мкр"},
                    {"Набережная", "наб."},
                    {"Некоммерческое партнерство", "н/п"},
                    {"Остров", "ост-в"},
                    {"Парк", "парк"},
                    {"Переезд", "пер-д"},
                    {"Переулок", "пер."},
                    {"Платформа", "платф."},
                    {"Площадка", "пл-ка"},
                    {"Площадь", "пл."},
                    {"Порт", "порт"},
                    {"Поселок", "п."},
                    {"Починок", "п-к"},
                    {"Проезд", "пр-д"},
                    {"Промышленная зона", "промзона"},
                    {"Промышленный район", "п/р"},
                    {"Просек", "пр-к"},
                    {"Просека", "пр-ка"},
                    {"Проселок", "пр-лок"},
                    {"Проспект", "пр-кт"},
                    {"Проулок", "проул."},
                    {"Разъезд", "рзд."},
                    {"Район", "р-н"},
                    {"Сад", "сад"},
                    {"Садовое товарищество", "с/т"},
                    {"снт", "снт"},
                    {"Село", "с."},
                    {"Сквер", "с-р"},
                    {"Слобода", "сл."},
                    {"Спуск", "с-к"},
                    {"Станция", "ст."},
                    {"Строение", "стр."},
                    {"Территория ГСК", "тер. ГСК"},
                    {"Территория ДНО", "тер. ДНО"},
                    {"Территория ДНП", "тер. ДНП"},
                    {"Территория ДНТ", "тер. ДНТ"},
                    {"Территория ДПК", "тер. ДПК"},
                    {"Территория ОНО", "тер. ОНО"},
                    {"Территория ОНП", "тер. ОНП"},
                    {"Территория ОНТ", "тер. ОНТ"},
                    {"Территория ОПК", "тер. ОПК"},
                    {"Территория ПК", "тер. ПК"},
                    {"Территория СНО", "тер. СНО"},
                    {"Территория СНП", "тер. СНП"},
                    {"Территория СНТ", "тер. СНТ"},
                    {"Территория СОСН ", "тер.СОСН "},
                    {"Территория СПК", "тер. СПК"},
                    {"Территория ТСЖ", "тер. ТСЖ"},
                    {"Территория ТСН", "тер. ТСН"},
                    {"Территория ФХ", "тер.ф.х."},
                    {"Территория", "тер."},
                    {"Тракт", "тракт"},
                    {"Тупик", "туп."},
                    {"Улица", "ул"},
                    {"Усадьба", "ус."},
                    {"Фермерское хозяйство", "ф/х"},
                    {"Хутор", "х."},
                    {"Шоссе", "ш."},
                    {"Юрты", "ю."}
                }
            },
            #endregion

            #region Street
            {
                AddressObjectGarLevel.Street, new Dictionary<string, string>
                {
                    {"Абонентский ящик", "а/я"},
                    {"Аллея", "ал."},
                    {"Балка", "балка"},
                    {"Берег", "берег"},
                    {"Бугор", "бугор"},
                    {"Бульвар", "б-р"},
                    {"Вал", "вал"},
                    {"Взвоз", "взв."},
                    {"Въезд", "въезд"},
                    {"Гаражно-строительный кооп.", "гск"},
                    {"Городок", "г-к"},
                    {"Дачное неком-е партнерство", "днп"},
                    {"Деревня", "д."},
                    {"Дорога", "дор"},
                    {"ж/д останов. (обгонный) пункт", "ж/д_оп"},
                    {"Железнодорожная будка", "ж/д б-ка"},
                    {"Железнодорожная казарма", "ж/д_казарм"},
                    {"Железнодорожная платформа", "ж/д_платф"},
                    {"Железнодорожная станция", "ж/д_ст."},
                    {"Железнодорожный пост", "ж/д_пост"},
                    {"Железнодорожный разъезд", "ж/д_рзд"},
                    {"Животноводческая точка", "жт"},
                    {"Заезд", "ззд."},
                    {"Зона", "зона"},
                    {"Казарма", "казарма"},
                    {"Квартал", "кв-л"},
                    {"Километр", "км"},
                    {"Кольцо", "к-цо"},
                    {"Коса", "коса"},
                    {"Линия", "лн."},
                    {"Магистраль", "мгстр."},
                    {"Маяк", "маяк"},
                    {"Местечко", "м"},
                    {"Местность", "местность"},
                    {"Микрорайон", "мкр"},
                    {"Мост", "мост"},
                    {"Набережная", "наб"},
                    {"Населенный пункт", "нп"},
                    {"Некоммерческое партнерство", "н/п"},
                    {"Остров", "остров"},
                    {"Парк", "парк"},
                    {"Переезд", "пер-д"},
                    {"Переулок", "пер"},
                    {"Планировочный район", "пл.р-н"},
                    {"Платформа", "платф"},
                    {"Площадка", "пл-ка"},
                    {"Площадь", "пл"},
                    {"Полустанок", "полустанок"},
                    {"Поселок", "п."},
                    {"Поселок и(при) станция(и)", "п/ст"},
                    {"Почтовое отделение", "п/о"},
                    {"Проезд", "пр-д"},
                    {"Промзона", "промзона"},
                    {"Просека", "пр-ка"},
                    {"Просек", "пр-к"},
                    {"Проселок", "пр-лок"},
                    {"Проспект", "пр-кт"},
                    {"Проулок", "проул."},
                    {"Разъезд", "рзд"},
                    {"Ряд(ы)", "ряд"},
                    {"Ряды", "ряды"},
                    {"Ряд", "ряд"},
                    {"Сад", "сад"},
                    {"Садовое неком-е товарищество", "снт"},
                    {"Садовое товарищество", "с/т"},
                    {"Село", "с"},
                    {"Сквер", "с-р"},
                    {"Слобода", "сл"},
                    {"Спуск", "с-к"},
                    {"Станция", "ст"},
                    {"Строение", "стр"},
                    {"Съезд", "сзд."},
                    {"Территория ДНТ", "тер. ДНТ"},
                    {"Территория СНТ", "тер. СНТ"},
                    {"Территория", "тер."},
                    {"Тракт", "тракт"},
                    {"Тупик", "туп"},
                    {"Улица", "ул"},
                    {"Участок", "уч-к"},
                    {"Ферма", "ферма"},
                    {"Фермерское хозяйство", "ф/х"},
                    {"Хутор", "х"},
                    {"Шоссе", "ш"}
                }
            }
            #endregion
        };

        public static string GetNameWithShortType(string fullName, AddressObjectGarLevel level)
        {
            if (fullName == null)
            {
                return null;
            }

            var (type, name) = GetWithShortName(fullName, level);

            return $"{name} {type}".Trim();
        }

        /// <summary>
        /// Получить список сокращенных названий типов адресных объектов
        /// </summary>
        /// <param name="level">уровень подчиненности по ГАР</param>
        public static string[] GetShortTypeNames(AddressObjectGarLevel level)
        {
            if (!Map.TryGetValue(level, out var types))
            {
                throw new ArgumentException(nameof(level));
            }

            return types.Values.ToArray();
        }

        public static (string Type, string Name) GetWithShortName(string fullName, AddressObjectGarLevel level)
        {
            if (fullName == null)
            {
                return (null, null);
            }

            var lowerFullName = fullName.ToLower();

            const string localityPstTypeName = "п/ст";
            if (level == AddressObjectGarLevel.Locality
                && lowerFullName.StartsWith(localityPstTypeName))
            {
                const int replaceCount = 1;
                var nameRegex = new Regex(Regex.Escape(localityPstTypeName), RegexOptions.IgnoreCase);
                var name = nameRegex.Replace(fullName, string.Empty, replaceCount).Trim();

                return (localityPstTypeName, name);
            }

            if (!Map.TryGetValue(level, out var types))
            {
                throw new ArgumentException(nameof(level));
            }

            foreach (var (typeName, shortTypeName) in types.Select(t => (t.Key, t.Value)).OrderByDescending(x => x.Key.Length))
            {
                if (lowerFullName.StartsWith(typeName.ToLower()))
                {
                    const int replaceCount = 1;
                    var nameRegex = new Regex(Regex.Escape(typeName), RegexOptions.IgnoreCase);
                    var name = nameRegex.Replace(fullName, string.Empty, replaceCount).Trim();

                    // Для некоторых адресных объектов не нужно отдельно указывать тип
                    if (TypelessAddressObject.Check(name))
                    {
                        return (null, name);
                    }

                    return (shortTypeName, name);
                }
            }

            return (null, null);
        }

        public static string GetFullTypeByShortType(string type, AddressPartLevel level)
        {
            if (string.IsNullOrEmpty(type))
            {
                return null;
            }

            if (!Map.TryGetValue(level.ToGarLevel(), out var types))
            {
                throw new ArgumentException(nameof(level));
            }

            return types.FirstOrDefault(t =>
                t.Value.TrimEnd('.').Equals(type.TrimEnd('.'), StringComparison.InvariantCultureIgnoreCase))
                .Key ?? type;
        }

        private static AddressObjectGarLevel ToGarLevel(this AddressPartLevel partLevel)
        {
            switch (partLevel)
            {
                case AddressPartLevel.Region:
                    return AddressObjectGarLevel.Region;
                case AddressPartLevel.District:
                    return AddressObjectGarLevel.District;
                case AddressPartLevel.Settlement:
                    return AddressObjectGarLevel.Settlement;
                case AddressPartLevel.City:
                    return AddressObjectGarLevel.City;
                case AddressPartLevel.Locality:
                    return AddressObjectGarLevel.Locality;
                case AddressPartLevel.PlanningStructure:
                    return AddressObjectGarLevel.PlanningStructure;
                case AddressPartLevel.Street:
                    return AddressObjectGarLevel.Street;
                default:
                    throw new ArgumentOutOfRangeException(nameof(partLevel), partLevel, null);
            }
        }
    }
}
