using System.Collections.Generic;
using System.Linq;

namespace Moedelo.Address.Shared
{
    public static class RegionCodeGetter
    {
        #region Region
        private static readonly Dictionary<string, string> RegionMap = new Dictionary<string, string>
        {
            { "Адыгея", "01" },
            { "Башкортостан", "02" },
            { "Бурятия", "03" },
            { "Алтай", "04" },
            { "Дагестан", "05" },
            { "Ингушетия", "06" },
            { "Кабардино-Балкарская", "07" },
            { "Калмыкия", "08" },
            { "Карачаево-Черкесская", "09" },
            { "Карелия", "10" },
            { "Коми", "11" },
            { "Марий Эл", "12" },
            { "Мордовия", "13" },
            { "Саха /Якутия/", "14" },
            { "Саха (Якутия)", "14" }, // Начиная с версии 2025-06-24 в ГАР изменилось название региона, т.к. регион в бд не храним, нужно оставить оба варианта.
            { "Северная Осетия - Алания", "15" },
            { "Татарстан", "16" },
            { "Тыва", "17" },
            { "Удмуртская", "18" },
            { "Хакасия", "19" },
            { "Чеченская", "20" },
            { "Чувашская Республика -", "21" },
            { "Алтайский", "22" },
            { "Краснодарский", "23" },
            { "Красноярский", "24" },
            { "Приморский", "25" },
            { "Ставропольский", "26" },
            { "Хабаровский", "27" },
            { "Амурская", "28" },
            { "Архангельская", "29" },
            { "Астраханская", "30" },
            { "Белгородская", "31" },
            { "Брянская", "32" },
            { "Владимирская", "33" },
            { "Волгоградская", "34" },
            { "Вологодская", "35" },
            { "Воронежская", "36" },
            { "Ивановская", "37" },
            { "Иркутская", "38" },
            { "Калининградская", "39" },
            { "Калужская", "40" },
            { "Камчатский", "41" },
            { "Кемеровская область - Кузбасс", "42" },
            { "Кировская", "43" },
            { "Костромская", "44" },
            { "Курганская", "45" },
            { "Курская", "46" },
            { "Ленинградская", "47" },
            { "Липецкая", "48" },
            { "Магаданская", "49" },
            { "Московская", "50" },
            { "Мурманская", "51" },
            { "Нижегородская", "52" },
            { "Новгородская", "53" },
            { "Новосибирская", "54" },
            { "Омская", "55" },
            { "Оренбургская", "56" },
            { "Орловская", "57" },
            { "Пензенская", "58" },
            { "Пермский", "59" },
            { "Псковская", "60" },
            { "Ростовская", "61" },
            { "Рязанская", "62" },
            { "Самарская", "63" },
            { "Саратовская", "64" },
            { "Сахалинская", "65" },
            { "Свердловская", "66" },
            { "Смоленская", "67" },
            { "Тамбовская", "68" },
            { "Тверская", "69" },
            { "Томская", "70" },
            { "Тульская", "71" },
            { "Тюменская", "72" },
            { "Ульяновская", "73" },
            { "Челябинская", "74" },
            { "Забайкальский", "75" },
            { "Ярославская", "76" },
            { "Москва", "77" },
            { "Санкт-Петербург", "78" },
            { "Еврейская", "79" },
            { "Ненецкий", "83" },
            { "Ханты-Мансийский Автономный округ - Югра", "86" },
            { "Чукотский", "87" },
            { "Ямало-Ненецкий", "89" },
            { "Запорожская", "90" },
            { "Крым", "91" },
            { "Севастополь", "92" },
            { "Донецкая Народная", "93" },
            { "Луганская Народная", "94" },
            { "Херсонская", "95" },
            { "Байконур", "99" }
        };
        #endregion

        public static string GetByName(string name)
        {
            if (RegionMap.TryGetValue(name, out var code))
            {
                return code;
            }

            return null;
        }

        public static string GetByString(string name)
        {
            var lowerName = name.ToLower().Trim();
            var key = RegionMap.Keys
                .OrderByDescending(k => k.Length)
                .FirstOrDefault(k => lowerName.Contains(k.ToLower()));

            return !string.IsNullOrEmpty(key) ? GetByName(key) : null;
        }
    }
}
