export default {
    notTaxable: `Не учитывается при расчёте налога.`,
    envd: `Не учитывается при расчёте налога.`,
    osno: `Не учитывается при расчёте налога.`,
    simple: `Не учитывается при расчёте налога.`,
    usn: `Не учитывается при расчёте налога.`,
    usn6: `Не учитывается при расчёте налога.`,
    osnoOutgoing: `Не учитывается при расчёте налога.`,
    needDocuments: `Не учитывается. Добавьте документ.`,
    usn15EnvdNotTaxableDocuments: `Расход в виде стоимости товара будет учитываться при расчете налога, если факт его покупки и продажи документально подтвержден`,
    onClosingOfMonth: `Расход будет признан при закрытии месяца в случае выполнения двух условий: начислено и оплачено - датой последнего события, на меньшую из сумм.`,
    usn15ReceiptStatementOnClosingOfMonth: `Авансовый платеж будет учтен в расходах при закрытии месяца в соответствии с графиком платежей по арендованному основному средству`,
    usnRentPaymentOnClosingOfMonth: `Расход будет признан при закрытии месяца датой последнего события на наименьшую сумму: начисление по договору и оплата платежа.`
};
