(function (common) {

    common.Data.NdsOperationTypes = {
        "1": "Отгрузка (передача) или приобретение товаров, работ, услуг (включая посреднические услуги), имущественных прав, за исключением операций, перечисленных по кодам 03, 04, 06, 10, 11, 13",
        "2": "Оплата, частичная оплата (полученная или переданная) в счет предстоящих поставок товаров (выполнения работ, оказания услуг (включая посреднические услуги)), передачи имущественных прав, за исключением операций, перечисленных по кодам 05, 06, 12",
        "3": "Возврат покупателем товаров продавцу или получение продавцом возвращенных покупателем товаров",
        "4": "Отгрузка (передача) или приобретение товаров, работ, услуг (за исключением посреднических услуг), имущественных прав на основе договора комиссии (агентского договора, в случае, если агент совершает действия от своего имени), за исключением операций, перечисленных по коду 06",
        "5": "Оплата, частичная оплата (полученная или переданная) в счет предстоящих поставок товаров (выполнения работ, оказания услуг (за исключением посреднических услуг)), передачи имущественных прав на основе договора комиссии (агентского договора, в случае, если агент совершает действия от своего имени), за исключением операций, перечисленных по коду 06",
        "6": "Операции, совершаемые налоговыми агентами, перечисленными в статье 161 Налогового кодекса Российской Федерации (Собрание законодательства Российской Федерации, 2000, N 32, ст. 3340; 2011, N 50, ст. 7359)  (Счета-фактуры налоговых агентов по ст.161 НК (аренда госимущества,..)",
        "7": "Операции, перечисленные в подпункте 2 пункта 1 статьи 146 Налогового кодекса Российской Федерации (Счета-фактуры на передачу тов.,раб., услуг для собственных нужд, расходы по которым не признаются для налога на прибыль)",
        "8": "Операции, перечисленные в подпункте 3 пункта 1 статьи 146 Налогового кодекса Российской Федерации (Счета-фактуры на СМР для собственного потребления)",
        "9": "Получение сумм, указанных в статье 162 Налогового кодекса Российской Федерации",
        "10": "Отгрузка (передача) или получение товаров, работ, услуг, имущественных прав на безвозмездной основе",
        "11": "Отгрузка (передача) или приобретение товаров, имущественных прав, перечисленных в пунктах 3, 4, 5.1 статьи 154, в подпунктах 1 - 4статьи 155 Налогового кодекса Российской Федерации",
        "12": "Оплата, частичная оплата (полученная или переданная) в счет предстоящих поставок товаров, передачи имущественных прав, перечисленных в пунктах 3, 4, 5.1 статьи 154, в подпунктах 1 - 4 статьи 155 Налогового кодекса Российской Федерации",
        "13": "Проведение подрядными организациями (застройщиками или техническими заказчиками) капитального строительства, модернизации (реконструкции) объектов недвижимости",
        "16": "Возврат товара от покупателя, который не признается плательщиком НДС (исключение – код 17)",
        "17": "Возврат товара от покупателя – физ. лица (расчеты наличными)",
        "18": "Составление или получение корректировочного счета-фактуры",
        "19": "Импорт товаров из Евразийского экономического союза",
        "20": "Импорт товаров на территорию РФ, в таможенных процедурах выпуска для внутреннего потребления, переработки для внутреннего потребления, временного ввоза и переработки вне таможенной территории",
        "21": "Восстановление НДС, в т. ч. при передаче имущества в УК компании, а также операции, облагаемые НДС по ставке 0 процентов",
        "22": "Возврат аванса по причине изменения условий договора",
        "23": "Приобретение услуг в командировке за наличные с получением БСО",
        "24": "Регистрация счетов-фактур в книге покупок в случаях, предусмотренных абз. 2 п.9 ст. 165 и п. 10 ст. 171 НК РФ",
        "25": "Регистрация счетов-фактур в книге покупок в отношении сумм налога, ранее восстановленных при совершении операций, облагаемых по ставке 0 процентов",
        "26": "Составление первичных документов при реализации лицам, не являющимся налогоплательщиками НДС, а также освобожденным от уплаты НДС",
        "27": "Составление сводного счета-фактуры комитентом или комиссионером",
        "28": "Составление сводного счета-фактуры на аванс комитентом или комиссионером"
    };
})(Common.module("Data"));