(function (common) {

    common.Data.OsnoNormalizedCostTypeLabels = {
        "0": "Нет",
        "1": "Расходы на возмещение затрат работников по уплате процентов по кредитам на приобретение или строительство жилого помещения", "2": "Расходы на НИОКР", "3": "Представительские расходы", "4": "Расходы на рекламу", "5": "Расходы в виде процентов по долговым обязательствам", "6": "Убыток от уступки права требования", "7": "Потери от недостачи и/или порчи при хранении и транспортировке МПЗ", "8": "Расходы по оплате стоимости проезда и провоза багажа работнику организации, расположенной в районах Крайнего Севера и приравненных к ним местностям, и членам его семьи", "9": "Расходы на обязательное страхование имущества", "10": "Расходы на компенсацию за использование для служебных поездок личного транспорта", "11": "Плата государственному и/или частному нотариусу за нотариальное оформление", "12": "Расходы обслуживающих производств и хозяйств"
    };
    
})(Common);